Tekla Open API Reference for Tekla Structures 2025
Load.LoadPartNamesEnum Enumeration
 The load part names.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum LoadPartNamesEnum
Public Enumeration LoadPartNamesEnum
Members
Member name | Value | Description
LOAD_PART_NAMES_EXCLUDE | 0 |  Exclude parts by name.
LOAD_PART_NAMES_INCLUDE | 1 |  Include parts by name.
See Also
Reference
Tekla.Structures.Model Namespace